
{
  "meta": {
    "app": "nihongo-nexus",
    "version": 4,
    "timestamp": "2025-12-22T10:00:20.596Z",
    "deviceName": "Windows NT 10.0; Win64; x64"
  },
  "data": {
    "nihongo-nexus-storage": {
      "state": {
        "vocabCount": 3980,
        "immersionMinutes": 1260,
        "grammarPoints": 45,
        "streak": 16,
        "lastLogDate": "2025-12-22T06:20:21.304Z",
        "logs": [],
        "masteredChapters": [],
        "grammarContext": "#separator:tab\n#html:true\n#tags column:7\nといえば\t\"Used to pick up a topic mentioned in the conversation or a topic that is currently on your mind and expand on it, often to ask a question or provide a typical association. It translates to \"\"Speaking of...\"\" or \"\"If we are talking about...\"\"\"\tお酒<b>といえば</b>、何が好き？<br>(Speaking of alcohol, what do you like?)<br><br>日本<b>といえば</b>、何が思いつきますか？<br>(Speaking of Japan, what comes to mind?)<br><br>安藤さん<b>といえば</b>、今日は来ないよね。<br>(Speaking of Ando-san, he isn't coming today, right?)\tNoun + といえば\tDo not use this to change the subject entirely - it must link to the previous context or a shared topic.\t\"<a href=\"\"http://www.youtube.com/watch?v=ZguoC5edy3c&amp;t=2m34s\"\">Watch Video Context (02:34)</a>\"\tQuartet::Chapter_1\nなら\t\"A contextual conditional meaning \"\"If that is the case\"\" or \"\"If it is true that...\"\" It is often used to give advice, suggestions, or requests based on what the other person just said or a specific situation.\"\t日本に行く<b>なら</b>、ラーメンも食べてみてください。<br>(If you are going to Japan, please try eating ramen too.)<br><br>チーズ<b>なら</b>、二種類が売っています。<br>(If it's cheese you are looking for, they sell two kinds.)<br><br>来る<b>なら</b>、私は帰ろうかな。<br>(If he is coming, I think I might go home.)\tVerb (Short Form) + なら<br>Noun + なら<br>Adjective + なら\t\"Unlike other conditionals (〜たら, 〜ば), なら can be used when the result (main clause) happens before the condition (dependent clause). For example, \"\"If you are going to Japan (future), buy a ticket (now).\"\"\"\t\"<a href=\"\"http://www.youtube.com/watch?v=ZguoC5edy3c&amp;t=10m28s\"\">Watch Video Context (10:28)</a>\"\tQuartet::Chapter_1\nとおり\t\"Expresses that an action is done in the same way as something else, or that a result matches a prediction or plan. It translates to \"\"just as,\"\" \"\"exactly as,\"\" or \"\"in accordance with.\"\"\"\t先生が言った<b>通り</b>に、勉強しました。<br>(I studied exactly as the teacher said.)<br><br>想像した<b>通り</b>、この公園は美しいですね。<br>(Just as I imagined, this park is beautiful, isn't it?)<br><br>計画<b>通り</b>、仕事がサクサク進んだ。<br>(Work proceeded smoothly, exactly as planned.)\t\"<img src=\"\"paste-9c35fdd21114b4fd8d7e9f14944cae01aab10b40.jpg\"\">\"\tWhen attaching directly to a Noun without 「の」, the pronunciation changes from toori to doori (e.g., 予定通り - Yotei doori).;\t\"<a href=\"\"http://www.youtube.com/watch?v=ZguoC5edy3c&amp;t=20m24s&quot;\"\">Watch Video Context (20:24)</a>\"\tQuartet::Chapter_1\nらしい\t\"This grammar point has two distinct meanings.<br><br>Hearsay/Conjecture: \"\"It seems that...\"\" or \"\"I heard that...\"\" based on reliable information or observation.<br>Typical/Authentic: expressing that something strongly displays the characteristic \"\"essence\"\" of that noun (e.g., \"\"very man-like\"\").\"\t\"明日の授業で映画を見る<b>らしい</b>。<br>(It seems we will watch a movie in tomorrow's class.)<br><br>結局、雨が降らない<b>らしい</b>。<br>(It seems it won't rain after all.)<br><br>このレストランは本当に日本<b>らしい</b>。<br>(This restaurant is truly authentic / very \"\"Japan-like\"\".)<br><br>子供<b>らしい</b>な。<br>(That is so child-like.)\"\tVerb/Adj/Noun (Plain Form) + らしい\t\"Distinguish between Noun + らしい (Typical/Authentic) and Noun + みたい (Resemblance). \"\"Kodomo rashii\"\" means a child acting like a child (positive/natural). \"\"Kodomo mitai\"\" means an adult acting like a child (childish/negative).\"\t\"<a href=\"\"http://www.youtube.com/watch?v=ZguoC5edy3c&amp;t=31m49s\"\">Watch Video Context (31:49)</a>\"\tQuartet::Chapter_1\nために・ための\t\"Expresses the purpose or objective of an action. It translates to \"\"in order to\"\" or \"\"for the purpose of.\"\" The subject of both clauses must be the same.\"\t1. ラーメンを食べるために、日本へ行った。 (I went to Japan in order to eat ramen.)<br>2. アニメを見るために、ネットフリックスを買いたい。 (I want to buy Netflix in order to watch anime.)<br>3. これはラーメンを食べるためのスプーンです。 (This is a spoon for [the purpose of] eating ramen.)<br>4. 映画やテレビを見るためのサービスです。 (It is a service for watching movies and TV shows.)\t\"<table border=\"\"1\"\"><tr><th>Type</th><th>Rule</th><th>Example</th></tr><tr><td><b>Verb</b></td><td>Dictionary Form + ために</td><td>食べるために (In order to eat)</td></tr><tr><td><b>Noun</b></td><td>Noun + の + ために</td><td>日本のために (For Japan)</td></tr><tr><td><b>Noun (Modifying)</b></td><td>Noun + の + ための + Noun</td><td>食べるためのスプーン (Spoon for eating)</td></tr></table>\"\tEnsure the verb before **ために** is a volitional action (something you can control). Do not use potential verbs here. If the subject is different in the second clause, use **ように** instead.\t\"<a href=\"\"https://www.youtube.com/watch?v=kQk1rbK-UwU&amp;t=143s\"\">Watch Video Context (02:23)</a>\"\tQuartet::Chapter_1\nがきっかけで\t\"Indicates the initial reason, motivation, or specific event that triggered an action or change. It translates to \"\"with... as the start/cue\"\" or \"\"motivated by...\"\"\"\t\"ブログ「Soul Beam」を読んだの<b>がきっかけで</b>、スペインに行きました。<br>(I went to Spain after being motivated by reading the blog \"\"Soul Beam\"\".)<br><br>新しい仕事を見つけたの<b>がきっかけで</b>、会社を辞めました。<br>(The cue for quitting my company was that I found a new job.)<br><br>BBQ<b>がきっかけで</b>、仲良くなりました。<br>(The initial reason we became friends was a BBQ.)\"\tNoun + がきっかけで<br>Verb (Short Past) + の / こと + がきっかけで\tIn conversation, people often use そのこと or それが (referring to the previous sentence) + きっかけで.\t\"<a href=\"\"https://www.youtube.com/watch?v=kQk1rbK-UwU&amp;t=12m40s\"\">Watch Video Context (12:40)</a>\"\tQuartet::Chapter_1\nようになる\tDescribes a change in state or habit. It indicates that someone has reached a point where they now do something they didn't do before, or have gained the ability to do something they couldn't do before.\tジムに通う<b>ようになった</b>。<br>(I started going to the gym regularly.)<br><br>毎日ゲームをする<b>ようになった</b>。<br>(I started playing games every day.)<br><br>筋トレができる<b>ようになった</b>。<br>(I became able to lift weights.)<br><br>思いついた曲が弾ける<b>ようになりたい</b>。<br>(I want to become able to play songs that come into my mind.)\tVerb (Dictionary Form) + ようになる (Habitual change)<br>Verb (Potential Form) + ようになる (Ability change)<br>Verb (Negative Form) + ようになる (Gradual cessation)\tUsing the negative (〜ないようになる) implies a gradual stop. To express a sudden stop or complete cessation, use 〜なくなる.\t\"<a href=\"\"https://www.youtube.com/watch?v=kQk1rbK-UwU&amp;t=22m31s\"\">Watch Video Context (22:31)</a>\"\tQuartet::Chapter_1\nようにする\tExpresses a conscious effort to do (or not do) something. 〜ようにする indicates a future decision or general rule, while 〜ようにしている indicates a current, ongoing effort.\t明日は早く着く<b>ようにする</b>よ。<br>(I'll make sure that I arrive early tomorrow.)<br><br>最近、毎晩八時間寝る<b>ようにしている</b>。<br>(Recently, I've been making an effort to sleep for eight hours every night.)<br><br>これからもっと飲む<b>ようにしたい</b>。<br>(From now on, I want to make it a point to drink more.)\tVerb (Dictionary Form) + ようにする<br>Verb (Negative Form) + ようにする\tDon't confuse with ことにする (to decide to do something). ようにする emphasizes the effort or attempt to create the habit/action.\t\"<a href=\"\"https://www.youtube.com/watch?v=kQk1rbK-UwU&amp;t=35m02s\"\">Watch Video Context (35:02)</a>\"\tQuartet::Chapter_1\nによると\tUsed to mark the source of information. It is almost always followed by a hearsay ending (like ～そうです or ～らしい) to indicate that the information is second-hand.\t天気予報<b>によると</b>、明日は大雨になるそうです。<br>(According to the weather forecast, it appears that tomorrow will be heavy rain.)<br><br>安藤さんの話<b>によると</b>、彼はゆきさんに嫌われているらしい。<br>(According to Ando-san's story, he is hated by Yuki apparently.)<br><br>ゆき<b>によると</b>、これからもっと飲むようにしたいらしい。<br>(According to Yuki, apparently she wants to make it a point to drink more from now on.)\tNoun + によると\tYou cannot end the sentence with a direct declaration of fact (e.g., 明日は雨です). You must soften it with a hearsay marker because you are quoting a source.\t\"<a href=\"\"https://www.youtube.com/watch?v=kQk1rbK-UwU&amp;t=43m13s\"\">Watch Video Context (43:13)</a>\"\tQuartet::Chapter_1\n～ずに / ～く\t\"This form is used to connect sentences, similar to the standard Te-form (meaning \"\"and\"\"), but it is primarily used in writing or formal speech. It gives a more polished, literary feel compared to the standard Te-form.<br><br>Verbs: Use the Masu-stem (e.g., tabe instead of tabete).<br>Negatives: Use the Nai-stem + zuni (e.g., tabezuni instead of tabenaide).<br>I-Adjectives: Remove the te from kute (e.g., yasuku instead of yasukute).\"\t私は学校に<b>勤め</b>、ユキはうちで働いている。<br>(Watashi wa gakkou ni tsutome, Yuki wa uchi de hataraite iru.) - I work at a school, and Yuki works at home.<br><br><b>食べずに</b>仕事に行きました。<br>(Tabezuni shigoto ni ikimashita.) - I went to work without eating.<br><br>勉強<b>せずに</b>テストを受けた。<br>(Benkyou sezuni tesuto o uketa.) - I took the test without studying.<br><br>材料を<b>混ぜ</b>、オーブンを１００度にセットし...<br>(Zairyou o maze, obun o hyakudo ni setto shi...) - Mix the ingredients, set the oven to 100 degrees, and...\t\"<table border=\"\"1\"\"><tbody><tr><th>Type</th><th>Rule</th><th>Root Form</th><th>Conjugation</th><th>English</th></tr><tr><td>Verbs (Positive)</td><td>Masu-stem</td><td>食べる (Taberu)</td><td>食べ (Tabe)</td><td>Eat (and...)</td></tr><tr><td>Verbs (Negative)</td><td>Nai-stem + zuni</td><td>食べる (Taberu)</td><td>食べずに (Tabezuni)</td><td>Without eating</td></tr><tr><td>Irregular (Neg)</td><td>Suru -&gt; Sezuni</td><td>する (Suru)</td><td>せずに (Sezuni)</td><td>Without doing</td></tr><tr><td>I-Adjectives</td><td>Stem + ku</td><td>安い (Yasui)</td><td>安く (Yasuku)</td><td>Cheap (and...)</td></tr></tbody></table>\"\t\"Learners often confuse this with being \"\"polite\"\" conversational Japanese. It is primarily a written or narrative form, not necessarily for polite spoken conversation (though zuni is often used in speech to emphasize \"\"without doing\"\").\"\t\"<a href=\"\"[Base_URL]&amp;t=1m55s\"\">Watch Video Context (01:55)</a>\"\tQuartet::Chapter_2\n～てくる\t\"Expresses a change that began in the past and has continued up to the present moment (\"\"have begun to X\"\"). It implies a process or emergence of a state. It is often used with verbs of change (like gaining weight, increasing, becoming).<br><br>Contrast: Te iku (will go on doing/will begin to) vs. Te kuru (have begun to/came to be).\"\t日が短く<b>なってきた</b>ね。<br>(Hi ga mijikaku natte kita ne.) - The days have begun to get shorter, haven't they?<br><br>最近ちょっと<b>痩せてきた</b>。<br>(Saikin chotto yasete kita.) - I've begun to lose a little weight recently.<br><br>納豆が食べられるように<b>なってきた</b>。<br>(Nattou ga taberareru you ni natte kita.) - I have begun to be able to eat natto (over time).\tVerb (Te-form) + くる (Kuru)\tConfusing Te kuru (process started in past leading to now) with Te iku (process starting now leading into future). Also, unlike simple past tense (kawatta - it changed), kawatte kita emphasizes the process of change leading up to now.\t\"<a href=\"\"[Base_URL]&amp;t=18m25s\"\">Watch Video Context (18:25)</a>\"\tQuartet::Chapter_2\n～しかない\t\"Emphasizes that there is \"\"nothing but\"\" or \"\"only\"\" a small amount of something. It conveys a negative nuance of insufficiency (i.e., \"\"I only have 5 minutes\"\" implies 5 minutes is not enough).<br><br>Rule: Always followed by a negative verb.\"\t昨日会社に二人<b>しかいなかった</b>。<br>(Kinou kaisha ni futari shika inakatta.) - There were only (nothing but) two people at the company yesterday.<br><br>会社まで五分<b>しかかからない</b>。<br>(Kaisha made gofun shika kakaranai.) - It takes only (nothing but) five minutes to get to work.<br><br>今日は納豆<b>しか食べなかった</b>。<br>(Kyou wa nattou shika tabenakatta.) - I didn't eat anything but natto today.\tNoun / Quantifier + しか (Shika) + Verb (Negative Form)\t\"Shika nai vs. Dake: Dake is neutral (\"\"only\"\"). Shika nai is subjective and emphasizes that the amount is too little or that there are no other options (negative nuance).\"\t\"<a href=\"\"[Base_URL]&amp;t=33m00s\"\">Watch Video Context (33:00)</a>\"\tQuartet::Chapter_2\n～ことにする\t\"Expresses a firm decision or determination to do (or not do) something. When used in the continuous form koto ni shite iru, it means \"\"make it a rule to do X\"\" or \"\"habitually do X based on a firm decision.\"\"\"\tそれを言わない<b>ことにする</b>。<br>(Sore o iwanai koto ni suru.) - I am determined not to say that.<br><br>明日早く行く<b>ことにする</b>。<br>(Ashita hayaku iku koto ni suru.) - I am determined/have decided to go early tomorrow.<br><br>ジムの後プロテインを飲む<b>ことにしている</b>。<br>(Jimu no ato purotein o nomu koto ni shite iru.) - I make it a rule to drink protein after the gym.\tVerb (Dictionary Form / Nai Form) + ことにする (Koto ni suru)\t\"Confused with You ni suru (Lesson 1). You ni suru implies \"\"trying one's best\"\" or making an effort. Koto ni suru implies a firm rule or schedule that is strictly followed.\"\t\"<a href=\"\"[Base_URL]&amp;t=42m04s\"\">Watch Video Context (42:04)</a>\"\tQuartet::Chapter_2\n気がつく / 気をつける / 気に入る\tCovers three common idioms using the word Ki (spirit/feeling):<br>気がつく (Ki ga tsuku): To notice or realize.<br>気をつける (Ki o tsukeru): To be careful of (more specific than just ki o tsukete).<br>気に入る (Ki ni iru): To be fond of / to like (used for specific items/experiences found agreeable, not general categories).\t後ろにいたことに<b>気がつかなかった</b>。<br>(Ushiro ni ita koto ni ki ga tsukanakatta.) - I didn't notice that you were behind me.<br><br>レッスンスライドの間違いに<b>気がついた</b>。<br>(Ressun suraido no machigai ni ki ga tsuita.) - I noticed a mistake on the lesson slide.<br><br>車に<b>気をつけて</b>。<br>(Kuruma ni ki o tsukete.) - Be careful of cars.<br><br>最近クラシック音楽が<b>気に入っている</b>。<br>(Saikin kurashikku ongaku ga ki ni itte iru.) - Recently, I am fond of classical music.\tNotice: Noun + に気がつく OR Verb/Adj (Short Form) + の/こと + に気がつく<br>Be Careful: Noun + に気をつける<br>Be Fond Of: Noun + が気に入る (Note: Uses particle ga)\t\"Ki ni iru (to be fond of/pleased with specific things) vs. Suki (general like). You cannot say \"\"Ongaku ga ki ni iru\"\" for music in general, you must specify, e.g., \"\"This song\"\" or \"\"Classical music.\"\" Also, Ki ni iru often uses the continuous form ~te iru to show a current state of being fond of something.\"\t\"<a href=\"\"[Base_URL]&amp;t=49m35s\"\">Watch Video Context (49:35)</a>\"\tQuartet::Chapter_2\n～おかげで\t\"This grammar point is used to express gratitude or attribute a positive result to a specific cause. It translates to \"\"Thanks to...\"\" or \"\"Because of...\"\". It is generally used for good outcomes.\"\tたくさん練習した<b>おかげで</b>、発表は大成功しました。<br>(Thanks to practicing a lot, the presentation was a big success.)<br><br>好き嫌いがない<b>おかげで</b>、食べ物を無駄にしない。<br>(Thanks to not being picky, I don't waste food.)<br><br>今日は仕事が楽な/暇な*<b>おかげで</b>、早く帰れた。<br>(Thanks to work being light/easy today, I was able to go home early.)<br><br>家族の<b>おかげで</b>、大学に入れました。<br>(Thanks to my family, I was able to enter university.)\tVerbs: Short form + おかげで<br>i-Adjectives: i-Adj + おかげで<br>na-Adjectives: na-Adj + な + おかげで<br>Nouns: Noun + の + おかげで\t\"Do not use this for negative results (irony aside). For negative outcomes (\"\"My car broke down because of the snow\"\"), use ～せいで (sei de) instead.\"\t\"<a href=\"\"https://www.youtube.com/watch?v=I-FhbIViHX4&t=2m59s\"\">Watch Video Context (02:59)</a>\"\tQuartet::Chapter_2\n～ば～ほど\t\"This pattern expresses a proportional relationship: \"\"The more [A], the more [B].\"\" It repeats the verb or adjective twice—first in the conditional 'ba' form, then in the dictionary form followed by 'hodo'.\"\t年を取れ<b>ば</b>取る<b>ほど</b>、考え方が固くなる。<br>(The older you get, the more rigid your way of thinking becomes.)<br><br>運動すれ<b>ば</b>する<b>ほど</b>、体力がつく。<br>(The more you exercise, the more stamina you gain.)<br><br>そのアイドルが人気であれ<b>ば</b>人気である<b>ほど</b>、チケットが取れない。<br>(The more popular that idol is, the harder it is to get tickets.)<br><br>今が幸せであれ<b>ば</b>ある<b>ほど</b>、なくなるのが怖い。<br>(The happier I am now, the more I fear losing it.)\t\"<table border=\"\"1\"\"><thead><tr><th>Type</th><th>Rule</th></tr></thead><tbody><tr><td>Verbs</td><td>[Verb Ba-Form] + [Verb Dictionary Form] + ほど</td></tr><tr><td>i-Adjectives</td><td>[i-Adj (-i) + ければ] + [i-Adj] + ほど</td></tr><tr><td>na-Adjectives</td><td>[na-Adj/Noun + であれば] + [na-Adj/Noun + である] + ほど</td></tr></tbody></table>\"\tEnsure you repeat the same word in both parts of the sentence.\t\"<a href=\"\"https://www.youtube.com/watch?v=I-FhbIViHX4&t=18m04s\"\">Watch Video Context (18:04)</a>\"\tQuartet::Chapter_2\nまるで～のようだ\t\"This structure creates a strong simile, meaning \"\"It is just like...\"\" or \"\"It is as if...\"\". まるで (Marude) emphasizes the resemblance. It can be used to modify nouns (～のような), verbs (～のように), or end a sentence (～のようだ).\"\tこのモンスターはとても可愛く、<b>まるで</b>犬<b>のようだ</b>。<br>(This monster is very cute, it's just like a dog.)<br><br>滝<b>のように</b>雨が降る。<br>(The rain falls like a waterfall.)<br><br>この家は<b>まるで</b>人が住んでいない<b>ようだ</b>。<br>(This house looks as if no one is living in it.)<br><br>悪魔<b>のような</b>笑い声。<br>(A laugh like a devil's.)\tEnd of Sentence: まるで + Noun + のようだ / Plain Form + ようだ<br>Modifying a Noun: まるで + Noun + のような + Noun<br>Modifying a Verb/Adj: まるで + Noun + のように + Verb/Adj\t\"This is for figurative descriptions (similes). If you are deducing something based on evidence (\"\"It looks like it rained because the ground is wet\"\"), use ～みたい or ～ようだ without 'marude'.\"\t\"<a href=\"\"https://www.youtube.com/watch?v=I-FhbIViHX4&t=29m01s\"\">Watch Video Context (29:01)</a>\"\tQuartet::Chapter_2\n～ことになった\t\"This implies a decision has been reached, often by an external force, a group, or simply how things turned out. It translates to \"\"It has been decided that...\"\" or \"\"It turned out that...\"\". The progressive form ～ことになっている is used for rules, customs, or scheduled routines.\"\t今週末、バーベキューをする<b>ことになった</b>。<br>(It has been decided that we will have a BBQ this weekend.)<br><br>熱が下がったので、病院に行かない<b>ことになった</b>。<br>(Since my fever went down, it was decided I wouldn't go to the hospital.)<br><br>冷蔵庫が壊れたので、新しいのを買う<b>ことになりました</b>。<br>(The fridge broke, so it was decided that we would buy a new one.)<br><br>長野市のバスは、降りる時料金を払う<b>ことになっています</b>。<br>(It is the rule/system for buses in Nagano City that you pay the fare when you get off.)\tVerb (Dictionary/Nai Form) + ことになった / ことになっている\tことになった (Decision made for you or by the group/situation) vs. ことにした (Decision made by you actively/volitionally).\t\"<a href=\"\"https://www.youtube.com/watch?v=I-FhbIViHX4&t=44m26s\"\">Watch Video Context (44:26)</a>\"\tQuartet::Chapter_2\n",
        "grammarDatabase": {
          "genki1_1": [
            {
              "id": "kz4ojf1qf",
              "point": "XはYです (X wa Y desu)",
              "meaning": "\"The particle \"\"wa\"\" (は) marks the topic of the sentence—what you are talking about. The structure \"\"X wa Y desu\"\" equates X with Y (X is Y). \"\"Desu\"\" functions as the polite copula (is/am/are). Unlike English, the verb always comes at the end of the sentence.\"",
              "sentences": "私は学生です。<br>I am a student.<br><br>専攻は日本語です。<br>My major is Japanese.<br><br>電話番号は何番ですか。<br>What is your telephone number?"
            }
          ]
        },
        "dailyChecklist": {},
        "completedDates": {
          "2025-12-22": true
        },
        "keepsakes": [
          {
            "id": "summer-hikaru-placeholder",
            "title": "The Summer Hikaru Died",
            "type": "ANIME",
            "status": "ONGOING",
            "coverUrl": "https://i.pinimg.com/736x/74/b5/4b/74b54b55d8c4972a5223df826861c9bb.jpg",
            "rating": 0,
            "caption": "",
            "durationOrVolumes": 120,
            "dateAdded": "2025-12-22",
            "dateCompleted": "",
            "showInTheater": true,
            "totalEpisodes": 12
          },
          {
            "id": "death-note-placeholder",
            "title": "Death Note",
            "type": "ANIME",
            "status": "ONGOING",
            "coverUrl": "https://i.pinimg.com/736x/f3/c5/26/f3c5262b088541744643cf1bc2ad75fb.jpg",
            "rating": 5,
            "caption": "i am SEATED ohmygod so many plot twist",
            "durationOrVolumes": 455,
            "dateAdded": "2025-12-22",
            "dateCompleted": "2025-12-22",
            "showInTheater": true,
            "totalEpisodes": 37
          }
        ],
        "activityLogs": [
          {
            "timestamp": 1766394194775,
            "category": "IMMERSION",
            "durationMinutes": 455,
            "summary": "Immersed with Death Note for 455m",
            "id": "a7e135ee-6d94-4dac-b0dd-fd9c52437c9a"
          }
        ]
      },
      "version": 9
    },
    "nihongo-nexus-immersion-v3": {
      "state": {
        "series": [
          {
            "id": "summer-hikaru-placeholder",
            "title": "The Summer Hikaru Died",
            "totalEpisodes": 12,
            "coverUrl": "https://i.pinimg.com/736x/74/b5/4b/74b54b55d8c4972a5223df826861c9bb.jpg"
          },
          {
            "id": "death-note-placeholder",
            "title": "Death Note",
            "totalEpisodes": 37,
            "coverUrl": "https://i.pinimg.com/736x/f3/c5/26/f3c5262b088541744643cf1bc2ad75fb.jpg"
          }
        ],
        "minedCards": [],
        "viewMode": "cinema",
        "layoutMode": "split",
        "subtitleOffset": 0,
        "metadataHydratedIds": []
      },
      "version": 2
    },
    "messenger_total_time": 2329,
    "grammar_total_time": 4319,
    "anki_total_time": 186176,
    "immersion_total_time": 26315
  }
};
